const Translit = (word) => {
    const a = {" ": "_","Ё":"yo","Й":"i","Ц":"ts","У":"u","К":"k","Е":"e","Н":"n","Г":"g","Ш":"sh","Щ":"sch","З":"z","Х":"h","Ъ":"","ё":"yo","й":"i","ц":"ts","у":"u","к":"k","е":"e","н":"n","г":"g","ш":"sh","щ":"sch","з":"z","х":"h","ъ":"'","Ф":"F","Ы":"I","В":"V","А":"A","П":"P","Р":"R","О":"O","Л":"L","Д":"D","Ж":"ZH","Э":"E","ф":"f","ы":"i","в":"v","а":"a","п":"p","р":"r","о":"o","л":"l","д":"d","ж":"zh","э":"e","Я":"Ya","Ч":"CH","С":"S","М":"M","И":"I","Т":"T","Ь":"'","Б":"b","Ю":"yu","я":"ya","ч":"ch","с":"s","м":"m","и":"i","т":"t","ь":"'","б":"b","ю":"yu"};
    
    return word.split('').map(function (char) {
        return a[char] || char;
    }).join("");
}

export default Translit